# Гласные и согласные
#
# На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет количество гласных и согласных букв.
#
# Формат входных данных
# На вход программе подается одна строка.
#
# Формат выходных данных
# Программа должна вывести количество гласных и согласных букв.
#
# Примечание. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 21 согласная буква
# (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).

# put your python code here
s = input()
gn, gl = 0, "ауоыиэяюёеАУОЫИЭЯЮЁЕ"
sn, sg = 0, "бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ"
for c in s :
    if c in gl : gn += 1
    if c in sg : sn += 1
print ("Количество гласных букв равно", gn)
print ("Количество согласных букв равно", sn)