# Сумма квадратов VS квадрат суммы
#
# Напишите программу, которая считывает два целых числа a и b и выводит на экран квадрат суммы (a+b)^2 и сумму квадратов a^2+b^2 этих чисел.
#
# Формат входных данных
# На вход программе подаётся два целых числа, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием.

# put your python code here
a, b = int(input()), int(input())
print("Квадрат суммы", a, "и", b, "равен", (a+b)*(a+b))
print("Сумма квадратов", a, "и", b, "равна", a*a+b*b)