# Напишите программу, которая выводит текст:
#
# "Python is a great language!", said Fred. "I don't ever remember having this much fun before."
#
# Примечание. Используйте конкатенацию строк.

# put your python code here
print('"Python is a great language!", said Fred. "I' + " don't ever remember having this much fun" + ' before."')