# Кастомный разделитель
#
# Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.
#
# Формат входных данных
# На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести введённые три строки через разделитель.

# put your python code here
st1 = input()
st2 = input()
st3 = input()
st4 = input()
print(st2, st3, st4, sep = st1, end = "")